tsung_tests/simple_login_single/simple_login.xml
<?xml version="1.0"?><tsung loglevel="debug" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
  <server host="52.91.203.252" port="8000" type="tcp"/>
</servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

   <sessions>
		<session name="simple_login" probability="100" type="ts_http">
		
    <request>
      <dyn_variable name="authenticity_token"/>
      <http url="http://54.86.31.175/login" version="1.1" method="GET">
      </http>
    </request>

		<request>
      <http url="/assets/application-85f3e37588d64cdc8817d7a50fc3c1d80f51f2e0f103d0a60a467698fe9a7f28.css" version="1.1" method="GET"/>
    </request>

		<request>
      <http url="/css/index.css" version="1.1" method="GET">
      </http>
    </request>

		<request>
      <http url="/assets/application-d3b407e8dc3d82934fb3d97690e3ef706d4d51c4871524fbc3f9fd4dbd1a731c.js" version="1.1" method="GET">
      </http>
    </request>

		<request>
      <http url="/favicon.png" version="1.1" method="GET"/>
    </request>

    <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="num"/>
      </setdynvars>

		<request subst="true">
      <http url="/login" version="1.1" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=user%%_num%%%40gmail.com&amp;session%5Bpassword%5D=123456&amp;commit=Log+in" content_type="application/x-www-form-urlencoded" method="POST">
      </http>
    </request>

		</session>

	</sessions>
</tsung>